
// 数位
export const NUMBER_RANKS = [ 
  "", "拾", "佰", "仟", "万",
  "拾", "佰", "仟", "亿", "拾",
  "佰", "仟", "万", "拾", "佰",
  "仟", "亿" 
]

// 人民币单位
export const CURRENCY_UNITS = [ '元', '角', '分', '厘', '毫' ]

// 数字 -> 中文
export const NUMBER_TO_ZH2 = {
  '0': '零',
  '1': '壹',
  '2': '贰',
  '3': '叁',
  '4': '肆',
  '5': '伍',
  '6': '陆',
  '7': '柒',
  '8': '捌',
  '9': '玖',
  '０': '零',
  '１': '壹',
  '２': '贰',
  '３': '叁',
  '４': '肆',
  '５': '伍',
  '６': '陆',
  '７': '柒',
  '８': '捌',
  '９': '玖',
}

// 数字 -> 中文
export const NUMBER_TO_ZH1 = {
  '0': '零',
  '1': '一',
  '2': '二',
  '3': '三',
  '4': '四',
  '5': '五',
  '6': '六',
  '7': '七',
  '8': '八',
  '9': '九',
  '０': '零',
  '１': '一',
  '２': '二',
  '３': '三',
  '４': '四',
  '５': '五',
  '６': '六',
  '７': '七',
  '８': '八',
  '９': '九',
}
