/**
 * 数位
 */
export const numRanks = [ 
    "", 
    "拾", 
    "佰", 
    "仟",
    "万",
    "拾",
    "佰",
    "仟",
    "亿",
    "拾",
    "佰",
    "仟",
    "万",
    "拾",
    "佰",
    "仟",
    "亿" 
];

/**
 * 人民币单位
 */
export const currencyUnits = [ 
    '元', 
    '角', 
    '分',
    '厘',
    '毫' 
];

/**
 * 数字映射
 */
export const numMapToCh = {
    '0': '零',
    '1': '壹',
    '2': '贰',
    '3': '叁',
    '4': '肆',
    '5': '伍',
    '6': '陆',
    '7': '柒',
    '8': '捌',
    '9': '玖',
    '０': '零',
    '１': '壹',
    '２': '贰',
    '３': '叁',
    '４': '肆',
    '５': '伍',
    '６': '陆',
    '７': '柒',
    '８': '捌',
    '９': '玖',
}
